package platform.kata.academy.javacore.chapter_1;

/*
Практическая задача 1.6.6 Практическое задание «Объявление строковой переменной String name и ее инициализация»

Задание:
В методе main (точка входа в программу) объяви строковую переменную String name и присвой ей твоё имя при инициализации, после чего выведи её в консоль.

Требования:
1. Переменная должна находиться в методе main
2. Переменная должна иметь тип String
3. Переменная должна иметь имя name
4. В консоль должно быть выведено значение переменной name
*/

public class Exercise_1_6_6 {
    public static void main(String[] args) {
        String name = "Nemov Aleksei";
        System.out.println(name);
    }
}
